Assignments/Final-Project/final.org
#+title: Final Project
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../myStyle.css" />
#+OPTIONS: html-style:nil H:3 toc:1 todo:nil author:nil date:nil num:nil
#+HTML_LINK_HOME: ../../material.html
Welcome to the final project for /CAS CS 392: Rust in Practice and in
Theory/.  As you know, we'll be building an interpreter for
[[https://dl.acm.org/doi/10.1145/3443420][Featherweight Rust (FR)]], a subset of Rust defined and formalized by
David J. Pearce.  I envisage this as something between a project spec
and a tutorial.  I'll be adding to it for each part of the project,
trying to gently guide you to the finish line.  I /won't/ be giving
any starter code, I'd like this project to be something that you build
from scratch.

Each part of the project will generally be presented in two forms:
1. *hard mode*, a high-level description with little detail and many
   degrees of freedom;
2. *easy mode*, a low-level description with more detail and fewer
   degrees of freedom.
The first form should be read as the actual project spec, what you're
required to do. The second form should be read as a guide to the
simplest way of satisfy the spec.  /The point being:/ if you want to
make this a fully featured interpreter, then go for it. As long as you
satisfy the spec.  If you're just looking to make it to the end, the
guide should provide a more direct path there.

Let's get started.

* Part 0: Set up

/At the beginning, there was a new crate./ Choose a "clever" name for
a small subset of Rust.  If you don't want to be clever, you can use
the name I'll be using for this page:[fn::I dunno, I guess salt is
usually a precursor to rust.]

#+begin_src bash
cargo new salt
#+end_src

First we're gonna set up our files. We want our project to have the
following structure in the directory ~salt/src~:
#+begin_src text
.
├── bin
│   ├── interp.rs
│   └── playground.rs
├── lib.rs
└── utils.rs
#+end_src
The files ~interp.rs~ and ~playground.rs~ should have empty ~main~
functions, ~utils.rs~ should be an empty file, and ~lib.rs~ should
contain the single line:
#+begin_src rust
pub mod utils;
#+end_src
A couple notes about this structure:
+ This crate has two executables. If we want to run the playground we
  can use ~cargo run --bin playground~ and if we want to run the
  interpreter, we can use ~cargo run --bin interp~.  This will be
  useful when we want to quickly check how Rust behaves on some
  program, and eventually when we want a file sitting around for
  testing the whole pipeline.
+ The file ~utils.rs~ will contain code that's shared across the
  project. You can put whatever you want in there (or get rid of it).
+ The file ~lib.rs~ is the entry point for all the code we write. By
  the end of this project, it'll have just a couple lines, making
  public the various parts of our interpreter.
  #+begin_src rust
    pub mod utils;  // PART 0
    pub mod eval;   // PART 1
    pub mod types;  // PART 2
    pub mod lexer;  // PART 3
    pub mod parser; // PART 3
  #+end_src

* Part 1: Semantics

/Then there was an evaluator./ We'll start by implementing the
semantics for FR. This means defining a couple things:

+ an enumeration for /expressions/ in FR (called /terms/ in the FR
  paper);
+ a structure representing the /evaluation context/ (this is a
  confluence of terms, it's not the same as an evaluation context in
  the FR paper (Definition 3.5), it's just a structure with the
  necessary data to perform evaluation);
+ a method for /evaluating/ expressions according to the FR spec.

#+begin_quote
*Important:* Keep in mind that in the next part we'll be implementing
a type/borrow checker. The point of the type/borrow checker is to make
sure we only evaluate /well-behaved/ expressions.  In practice this
means ~unwrap~ to your hearts delight.[fn::Although you should keep in
mind that using ~unwrap~ a lot can make code a bit harder to debug.]
#+end_quote

** Hard-Mode

At a high-level, you need to implement the following according to the
FR spec:
#+begin_src rust
  struct Expr     // TODO
  struct Value    // TODO
  struct Lifetime // TODO
  struct Context  // TODO


  impl Context {
    fn eval_expr(&mut self, e : &Expr, l: Lifetime) -> Value { todo!() }
  }
#+end_src

If that's all you need, then have at it. Feel free to put the code
wherever it's clear.

** Easy-Mode

Create an empty file ~src/eval.rs~ and add the following line to the
file ~src/lib.rs~:

#+begin_src rust
pub mod eval;
#+end_src

