Assignments/Final-Project/final.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-03 Thu 16:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Final Project</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../myStyle.css" />

</head>
<body>
<div id="org-div-home-and-up"><a href="../../material.html">↩</a></div><div id="content" class="content">
<h1 class="title">Final Project</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5cf4d9a">Part 0: Set up</a></li>
<li><a href="#orge2780c7">Part 1: Semantics</a></li>
</ul>
</div>
</div>
<p>
Welcome to the final project for <i>CAS CS 392: Rust in Practice and in
Theory</i>.  As you know, we'll be building an interpreter for
<a href="https://dl.acm.org/doi/10.1145/3443420">Featherweight Rust (FR)</a>, a subset of Rust defined and formalized by
David J. Pearce.  I envisage this as something between a project spec
and a tutorial.  I'll be adding to it for each part of the project,
trying to gently guide you to the finish line.  I <i>won't</i> be giving
any starter code, I'd like this project to be something that you build
from scratch.
</p>

<p>
Each part of the project will generally be presented in two forms:
</p>
<ol class="org-ol">
<li><b>hard mode</b>, a high-level description with little detail and many
degrees of freedom;</li>
<li><b>easy mode</b>, a low-level description with more detail and fewer
degrees of freedom.</li>
</ol>
<p>
The first form should be read as the actual project spec, what you're
required to do. The second form should be read as a guide to the
simplest way of satisfy the spec.  <i>The point being:</i> if you want to
make this a fully featured interpreter, then go for it. As long as you
satisfy the spec.  If you're just looking to make it to the end, the
guide should provide a more direct path there.
</p>

<p>
Let's get started.
</p>

<div id="outline-container-org5cf4d9a" class="outline-2">
<h2 id="org5cf4d9a">Part 0: Set up</h2>
<div class="outline-text-2" id="text-org5cf4d9a">
<p>
<i>At the beginning, there was a new crate.</i> Choose a "clever" name for
a small subset of Rust.  If you don't want to be clever, you can use
the name I'll be using for this page:<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-bash">cargo new salt
</pre>
</div>

<p>
First we're gonna set up our files. We want our project to have the
following structure:
</p>
<div class="org-src-container">
<pre class="src src-text">.
&#9500;&#9472;&#9472; bin
&#9474;&#160;&#160; &#9500;&#9472;&#9472; interp.rs
&#9474;&#160;&#160; &#9492;&#9472;&#9472; playground.rs
&#9500;&#9472;&#9472; lib.rs
&#9492;&#9472;&#9472; utils.rs
</pre>
</div>
<p>
The files <code>interp.rs</code> and <code>playground.rs</code> should have empty <code>main</code>
functions, <code>utils.rs</code> should be an empty file, and <code>lib.rs</code> should
contain the single line:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">utils</span>;
</pre>
</div>
<p>
A couple notes about this structure:
</p>
<ul class="org-ul">
<li>This crate has two executables. If we want to run the playground we
can use <code>cargo run --bin playground</code> and if we want to run the
interpreter, we can use <code>cargo run --bin interp</code>.  This will be
useful when we want to quickly check how Rust behaves on some
program, and eventually when we want a file sitting around for
testing the whole pipeline.</li>
<li>The file <code>utils.rs</code> will contain code that's shared across the
project. You can put whatever you want in there (or get rid of it).</li>
<li><p>
The file <code>lib.rs</code> is the entry point for all the code we write. By
the end of this project, it'll have just a couple lines, making
public the various parts of our interpreter.
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">utils</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">PART 0</span>
<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">eval</span>;   <span style="color: #b22222;">// </span><span style="color: #b22222;">PART 1</span>
<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">types</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">PART 2</span>
<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">lexer</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">PART 3</span>
<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">parser</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">PART 3</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orge2780c7" class="outline-2">
<h2 id="orge2780c7">Part 1: Semantics</h2>
<div class="outline-text-2" id="text-orge2780c7">
<p>
<i>Then there was an evaluator.</i> We'll start by implementing the
semantics for FR. This means defining a couple things:
</p>

<ul class="org-ul">
<li>an enumeration for <i>expressions</i> in FR (called <i>terms</i> in the FR
paper);</li>
<li>a structure representing the <i>evaluation context</i> (this is a
confluence of terms, it's not the same as an evaluation context in
the FR paper (Definition 3.5), it's just a structure with the
necessary data to perform evaluation);</li>
<li>a method for <i>evaluating</i> expressions according to the FR spec.</li>
</ul>

<blockquote>
<p>
<b>Important:</b> Keep in mind that in the next part we'll be implementing
a type/borrow checker. The point of the type/borrow checker is to make
sure we only evaluate <i>well-behaved</i> expressions.  In practice this
means <code>unwrap</code> to your hearts delight.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>
</blockquote>
</div>

<div id="outline-container-orga95bba6" class="outline-3">
<h3 id="orga95bba6">Hard-Mode</h3>
<div class="outline-text-3" id="text-orga95bba6">
<p>
At a high-level, you need to implement the following according to the
FR spec:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Expr</span>     <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Value</span>    <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Lifetime</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Context</span>  <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO</span>


<span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Context</span> {
  <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">eval_expr</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">mut</span> <span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">e</span> : <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Expr</span>, <span style="color: #a0522d;">l</span>: <span style="color: #228b22;">Lifetime</span>) -&gt; <span style="color: #228b22;">Value</span> { <span style="color: #483d8b;">todo!</span>() }
}
</pre>
</div>

<p>
If that's all you need, then have at it. Feel free to put the code
wherever it's clear.
</p>
</div>
</div>

<div id="outline-container-orgaab9df5" class="outline-3">
<h3 id="orgaab9df5">Easy-Mode</h3>
<div class="outline-text-3" id="text-orgaab9df5">
<p>
Create an empty file <code>src/eval.rs</code> and add the following line to the
file <code>src/lib.rs</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">eval</span>;
</pre>
</div>
</div>
