Assignments/Final-Project/final.org
*** Programs

Let's start by giving a slightly different grammar for FR:

#+begin_src bnf
  <expr>  ::= '{' { <stmt> '⨟' } [<expr>] '}'
	    | 'Box::new' '(' <expr> ')'
	    | <lval>
	    | '&' ['mut'] <lval>
	    | <int>

  <stmt>  ::= <expr>
	    | 'let' 'mut' <var> '=' <expr>
	    | <lval> '=' <expr>

  <lval>  ::= <var>
	    | '*' <lval>

  <prog>  ::=
#+end_src

The biggest different between this syntax and the given one is that we
distinguish between expressions and statements.[fn::These are combined
in to a notion of a /term/ in the FR paper.]

From this grammar we get a natural AST (which we can put into the file
~src/utils.rs~):

#+begin_src rust
  pub type Ident = String;
  type Copyable = bool;
  type Mutable = bool;

  struct Lifetime(usize); // THIS WILL CHANGE

  pub struct Lval {
      pub ident: Ident,
      pub derefs: usize,
  }

  pub enum Expr {
      Unit,
      Int(i32),
      Lval(Lval, Copyable),
      Box(Box<Expr>),
      Borrow(Lval, Mutable),
      Block(Vec<Stmt>, Box<Expr>, Lifetime),
  }

  pub enum Stmt {
      Assign(Lval, Expr),
      LetMut(Ident, Expr),
      Expr(Expr),
  }
#+end_src

*** Program Store

Next we need some machinary to define the notion of a /program
store/. A quick reminder of definitions (see the FR paper (pg. 13-15)
for more details):

+ A *location* is an abstract entity that is either /named/ or
  /unnamed/. In reality, unnnamed locations still need unique
  identifers, but they don't correspond to any variable name in the
  program.
+ A *value* is:
  + unit ($\epsilon$);
  + an integer;
  + a /reference/, which a location that is either owned
    ($\ell^\bullet$) or borrowed ($\ell^\circ$).
+ A *partial value* is either a value or /undefined/ ($\bot$).
+ A *slot value* is a partial value together with a lifetime ($\langle v
  \rangle^m$).
+ The *program store* ($\mathcal S$) is a map from locations to slots
  values.

We can do a pretty direct translation of these constructs, and put
them in ~src/eval.rs~:
#+begin_src rust
  type Location = Ident;
  type Owned = bool;

  pub enum Value {
      Unit,
      Int(i32),
      Ref(Location, Owned),
  }

  type Pvalue = Option<Value>;

  pub struct Slot {
      value: Pvalue,
      lifetime: Lifetime,
  }

  struct Store(HashMap<Location, Slot>);
#+end_src

We'll take unnamed locations to be locations given fresh identifiers.

The semantics of FR is presented against an interface of functions on
program stores (~write~ returns the old value in the slot):

#+begin_src rust
  impl Store {
      fn locate(&self, w: &Lval) -> &Location { todo!() }
      fn read(&self, x: &Lval) -> &Slot { todo!() }
      fn write(&mut self, x: &Lval, v: Pvalue) -> Pvalue { todo!() }
      fn drop(&mut self, values: Vec<Pvalue>) { todo! () }
  }
#+end_src

