Assignments/Final-Project/final.html

<div id="outline-container-org53cb4a6" class="outline-4">
<h4 id="org53cb4a6">Programs</h4>
<div class="outline-text-4" id="text-org53cb4a6">
<p>
Let's start by giving a slightly different grammar for FR:
</p>

<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">expr</span>&gt;  <span style="color: #008b8b;">::=</span> '{' { &lt;<span style="color: #483d8b;">stmt</span>&gt; '&#10783;' } [&lt;<span style="color: #483d8b;">expr</span>&gt;] '}'
          <span style="color: #ff0000; font-weight: bold;">|</span> 'Box::new' '(' &lt;<span style="color: #483d8b;">expr</span>&gt; ')'
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">lval</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> '&amp;' ['mut'] &lt;<span style="color: #483d8b;">lval</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">int</span>&gt;

&lt;<span style="color: #0000ff;">stmt</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> 'let' 'mut' &lt;<span style="color: #483d8b;">var</span>&gt; '=' &lt;<span style="color: #483d8b;">expr</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">lval</span>&gt; '=' &lt;<span style="color: #483d8b;">expr</span>&gt;

&lt;<span style="color: #0000ff;">lval</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> '*' &lt;<span style="color: #483d8b;">lval</span>&gt;

&lt;<span style="color: #0000ff;">prog</span>&gt;  <span style="color: #008b8b;">::=</span>
</pre>
</div>

<p>
The biggest different between this syntax and the given one is that we
distinguish between expressions and statements.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
</p>

<p>
From this grammar we get a natural AST (which we can put into the file
<code>src/utils.rs</code>):
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Ident</span> = <span style="color: #228b22;">String</span>;
<span style="color: #a020f0;">type</span> <span style="color: #228b22;">Copyable</span> = <span style="color: #228b22;">bool</span>;
<span style="color: #a020f0;">type</span> <span style="color: #228b22;">Mutable</span> = <span style="color: #228b22;">bool</span>;

<span style="color: #a020f0;">type</span> <span style="color: #228b22;">Lifetime</span> = <span style="color: #228b22;">Lifetime</span>(<span style="color: #228b22;">usize</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">THIS WILL CHANGE</span>

<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Lval</span> {
    <span style="color: #a020f0;">pub</span> <span style="color: #a0522d;">ident</span>: <span style="color: #228b22;">Ident</span>,
    <span style="color: #a020f0;">pub</span> <span style="color: #a0522d;">derefs</span>: <span style="color: #228b22;">usize</span>,
}

<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Expr</span> {
    <span style="color: #228b22;">Unit</span>,
    <span style="color: #228b22;">Int</span>(<span style="color: #228b22;">i32</span>),
    <span style="color: #228b22;">Lval</span>(<span style="color: #228b22;">Lval</span>, <span style="color: #228b22;">Copyable</span>),
    <span style="color: #228b22;">Box</span>(<span style="color: #228b22;">Box</span>&lt;<span style="color: #228b22;">Expr</span>&gt;),
    <span style="color: #228b22;">Borrow</span>(<span style="color: #228b22;">Lval</span>, <span style="color: #228b22;">Mutable</span>),
    <span style="color: #228b22;">Block</span>(<span style="color: #228b22;">Vec</span>&lt;<span style="color: #228b22;">Stmt</span>&gt;, <span style="color: #228b22;">Box</span>&lt;<span style="color: #228b22;">Expr</span>&gt;, <span style="color: #228b22;">Lifetime</span>),
}

<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Stmt</span> {
    <span style="color: #228b22;">Assign</span>(<span style="color: #228b22;">Lval</span>, <span style="color: #228b22;">Expr</span>),
    <span style="color: #228b22;">LetMut</span>(<span style="color: #228b22;">Ident</span>, <span style="color: #228b22;">Expr</span>),
    <span style="color: #228b22;">Expr</span>(<span style="color: #228b22;">Expr</span>),
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org509a4ca" class="outline-4">
<h4 id="org509a4ca">Program Store</h4>
<div class="outline-text-4" id="text-org509a4ca">
<p>
Next we need some machinary to define the notion of a <i>program
store</i>. A quick reminder of definitions (see the FR paper (pg. 13-15)
for more details):
</p>

<ul class="org-ul">
<li>A <b>location</b> is an abstract entity that is either <i>named</i> or
<i>unnamed</i>. In reality, unnnamed locations still need unique
identifers, but they don't correspond to any variable name in the
program.</li>
<li>A <b>value</b> is:
<ul class="org-ul">
<li>unit (\(\epsilon\));</li>
<li>an integer;</li>
<li>a <i>reference</i>, which a location that is either owned
(\(\ell^\bullet\)) or borrowed (\(\ell^\circ\)).</li>
</ul></li>
<li>A <b>partial value</b> is either a value or <i>undefined</i> (\(\bot\)).</li>
<li>A <b>slot value</b> is a partial value together with a lifetime (\(\langle v
  \rangle^m\)).</li>
<li>The <b>program store</b> (\(\mathcal S\)) is a map from locations to slots
values.</li>
</ul>

<p>
We can do a pretty direct translation of these constructs, and put
them in <code>src/eval.rs</code>:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">type</span> <span style="color: #228b22;">Location</span> = <span style="color: #228b22;">Ident</span>;
<span style="color: #a020f0;">type</span> <span style="color: #228b22;">Owned</span> = <span style="color: #228b22;">bool</span>;

<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">Value</span> {
    <span style="color: #228b22;">Unit</span>,
    <span style="color: #228b22;">Int</span>(<span style="color: #228b22;">i32</span>),
    <span style="color: #228b22;">Ref</span>(<span style="color: #228b22;">Location</span>, <span style="color: #228b22;">Owned</span>),
}

<span style="color: #a020f0;">type</span> <span style="color: #228b22;">Pvalue</span> = <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">Value</span>&gt;;

<span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Slot</span> {
    <span style="color: #a0522d;">value</span>: <span style="color: #228b22;">Pvalue</span>,
    <span style="color: #a0522d;">lifetime</span>: <span style="color: #228b22;">Lifetime</span>,
}

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Store</span>(<span style="color: #228b22;">HashMap</span>&lt;<span style="color: #228b22;">Location</span>, <span style="color: #228b22;">Slot</span>&gt;);
</pre>
</div>

<p>
We'll take unnamed locations to be locations given fresh identifiers.
</p>

<p>
The semantics of FR is presented against an interface of functions on
program stores (<code>write</code> returns the old value in the slot):
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Store</span> {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">locate</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">w</span>: <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Lval</span>) -&gt; <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Location</span> { <span style="color: #483d8b;">todo!</span>() }
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">read</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">x</span>: <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Lval</span>) -&gt; <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Slot</span> { <span style="color: #483d8b;">todo!</span>() }
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">write</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">mut</span> <span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">x</span>: <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Lval</span>, <span style="color: #a0522d;">v</span>: <span style="color: #228b22;">Pvalue</span>) -&gt; <span style="color: #228b22;">Pvalue</span> { <span style="color: #483d8b;">todo!</span>() }
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">drop</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">mut</span> <span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">values</span>: <span style="color: #228b22;">Vec</span>&lt;<span style="color: #228b22;">Pvalue</span>&gt;) { <span style="color: #483d8b;">todo!</span> () }
}
</pre>
</div>
</div>
</div>
