Assignments/Final-Project/final.html

<div id="outline-container-orgf356171" class="outline-4">
<h4 id="orgf356171">Evaluation</h4>
<div class="outline-text-4" id="text-orgf356171">
<p>
Finally, the <b>evaluation context</b> is a structure with a program store,
along with whatever other data we need in order to perform evaluation:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Context</span> {
    <span style="color: #a0522d;">store</span>: <span style="color: #228b22;">Store</span>,
    <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO: anything else you need</span>
}
</pre>
</div>

<p>
All that's left to do is implement <i>two</i> evaluation functions, one for
expressions and one for statements:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Context</span> {
    <span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">eval_expr</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">mut</span> <span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">expr</span>: <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Expr</span>, <span style="color: #a0522d;">l</span>: <span style="color: #228b22;">Lifetime</span>) -&gt; <span style="color: #228b22;">Value</span> { <span style="color: #483d8b;">todo!</span>() }
    <span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">eval_stmt</span>(<span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #a020f0;">mut</span> <span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">stmt</span>: <span style="color: #000000; background-color: #ffffff;">&amp;</span><span style="color: #228b22;">Stmt</span>, <span style="color: #a0522d;">l</span>: <span style="color: #228b22;">Lifetime</span>) { <span style="color: #483d8b;">todo!</span>() }
}
</pre>
</div>

<p>
Evaluating an expression returns a value, whereas evaluating a
statement only modifies the evaluation context (i.e., the program
store).  This is a bit more natural compared to what is done in the FR
paper, in which statements need to artificially be given values in
order to define the semantics.
</p>

<p>
The trick is that we won't implement the semantics given in the FR
paper, but instead its equivalent <i>big-step</i> semantics.
</p>

<p>
I'm going to leave this as part of the challenge of the project, but
hopefully a couple examples will get you thinking about how to come up
with the right big-step semantics for FR.
</p>

<blockquote>
<p>
<b>Example:</b> Take the rule \(\text{R-Box}\) and it's associated rule in
\(\text{R-Sub}\):
</p>

\begin{align*}
\frac
{\ell_n \not \in \mathbf{dom}(\mathcal S_1) \qquad \mathcal S_2 = \mathcal S_1 [\ell_n \mapsto \langle v \rangle^*] }
{\langle \ \mathcal S_1 \vartriangleright \texttt{box} \ v \longrightarrow \mathcal S_2 \vartriangleright \ell_n^\bullet \ \rangle^l}
\ (\text{R-Box})
\end{align*}
\begin{align*}
\frac
{\langle \ \mathcal S_1 \vartriangleright t_1 \longrightarrow \mathcal S_2 \vartriangleright t_2 \ \rangle^l}
{\langle \ \mathcal S_1 \vartriangleright \texttt{box} \ t_1 \longrightarrow \mathcal S_2 \vartriangleright \texttt{box} \ t_2 \ \rangle^l}
\ (\text{R-Sub})
\end{align*}

<p>
The rule \(\text{R-Sub}\) states that we need to evaluate the argument
of a box constructor before evaluating the box expression itself (the
'\(v\)' in \(\text{R-Box}\) is a value).  We can package this into a
single big-step rule:
</p>

\begin{align*}
&\frac
{\langle \ \mathcal S_1 \vartriangleright e \Downarrow \mathcal S_2 \vartriangleright v \ \rangle^l
\qquad \ell_n \not \in \mathbf{dom}(\mathcal S_2)
\qquad \mathcal S_3 = \mathcal S_2 [\ell_n \mapsto \langle v \rangle^*] }
{\langle \ \mathcal S_1 \vartriangleright \texttt{box} \ e \Downarrow \mathcal S_3 \vartriangleright \ell_n^\bullet \ \rangle^l}
\ (\text{R-Box-Big})
\end{align*}

<p>
Note that "\(\ell_n \not \in \mathbf{dom}(\mathcal S_2)\)" is just a
freshness condition, expressing that \(n\) is a fresh unique identifier.
</p>
</blockquote>

<blockquote>
<p>
<b>Example:</b> In the case of statements, consider the rules \(\text{R-Declare}\) and
its associated rule in \(\text{R-Sub}\):
</p>

\begin{align*}
\frac
{\mathcal S_2 = \mathcal S_1[\ell_x \mapsto \langle v \rangle^l]}
{\langle \ \mathcal S_1 \vartriangleright \texttt{let mut} \ x \ \texttt{=} \ v \longrightarrow \mathcal S_2 \vartriangleright \epsilon \ \rangle^l}
\ (\text{R-Declare})
\end{align*}
\begin{align*}
\frac
{\langle \ \mathcal S_1 \vartriangleright t_1 \longrightarrow \mathcal S_2 \vartriangleright t_2 \ \rangle^l}
{\langle \ \mathcal S_1 \vartriangleright \texttt{let mut} \ x \ \texttt{=} \ t_1 \longrightarrow \mathcal S_2 \vartriangleright \texttt{let mut} \ x \ \texttt{=} \ t_2 \ \rangle^l}
\ (\text{R-Sub})
\end{align*}

<p>
We can package this into a single big-step rule, except now there is
no need to return a value, just a new store:
</p>

\begin{align*}
\frac
{
\langle \ \mathcal S_1 \vartriangleright e \Downarrow \mathcal S_2 \vartriangleright v \ \rangle^l \qquad
\mathcal S_3 = \mathcal S_2[\ell_x \mapsto \langle v \rangle^l]
}
{\langle \ \mathcal S_1 \vartriangleright \texttt{let mut} \ x \ \texttt{=} \ v \Downarrow \mathcal S_3 \rangle^l}
\ (\text{R-Declare-Big})
\end{align*}
</blockquote>

<p>
The name of the game is determining how to do this translation for
the remaining rules.  It's a bit more work conceptually, but I think a
fair amount easier in the implementation.
</p>
</div>
</div>

<div id="outline-container-orgb9e468d" class="outline-4">
<h4 id="orgb9e468d">Remarks</h4>
<div class="outline-text-4" id="text-orgb9e468d">
<ul class="org-ul">
<li>One thing we're hand-waving here is our definition of <code>Lifetime</code>.
The only thing that's required of lifetimes for the semantics is
that every block is labeled with a <i>unique</i> lifetime.  This is so
the semantics of dropping is correct (we don't want to drop values
from the wrong block).</li>
<li><p>
In the \(\text{R-Box-Big}\) rule, you'll need to use the <i>global</i>
lifetime.  The easiest way to deal with this for now is to define an
method for <code>Lifetime</code>:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Lifetime</span> {
    <span style="color: #a020f0;">pub</span> <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">global</span>() -&gt; <span style="color: #228b22;">Lifetime</span> {
        <span style="color: #228b22;">Lifetime</span>(0)
    }
}
</pre>
</div>
<p>
Then when we update the definition of <code>Lifetime</code> for our type/borrow
checker, we won't need to update the evaluator at all.
</p></li>
<li>There are many small missing details even in this description of the
code.  It'll be worthwhile to create some methods, derive some
traits, the usual things we need when putting together a Rust
project.</li>
<li>One way you might want to extend your implementation to be more
useful is to carry metadata in the expression to make error messages
more useful.</li>
<li>A quick reminder that this is the first iteration of this course, so
<i>I don't really know what y'all are going to struggle with the
most.</i> Please ask questions, because it helps me out too!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">I dunno, I guess salt is
usually a precursor to rust.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Although you should keep in
mind that using <code>unwrap</code> a lot can make code a bit harder to debug.</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">These are combined
in to a notion of a <i>term</i> in the FR paper.</p></div></div>


</div>
</div></div>
</body>
</html>
